"""
Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки."""


# a = int(input())
# d = int(input())
# n = int(input())
# list1 = list()
# for i in range(1, n + 1):
#     list1.append(a + (i - 1) * d)
# print(list1)

"""
Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного 
минимума и не больше заданного максимума)
"""
# n = int(input())
# list1 = []
# for i in range(n):
#     list1.append(int(input()))
# print(list1)
# min = int(input())
# max = int(input())

# list_res = []
# for i in range(len(list1)):
#     if min <= list1[i] <= max:
#         list_res.append(i)
# print(list_res)
