"""
Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты 
вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть/
Пример: 
input 5  1 0 1 0 1 1
output 2
"""
# n = int(input())
# k1 = 0
# k0 = 0
# for i in range(n):
#     x = int(input())
#     if x == 0:
#         k0 += 1
#     else:
#         k1 += 1
# if k0 > k1:
#     print(k1)
# else:
#     print(k0)

"""
Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
Пример:
input
5 6
output
2 3 
"""
# s = int(input())
# p = int(input())
# x = 0
# y = 0
# i = 0
# flag = True
# while flag:    
#     y = s - i
#     x = s - y
#     print(x, y, i)
#     if x + y == s and x * y == p:
#         flag = False
#         print(x, y)
#     else:
#         i += 1

"""
Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
Пример 10
2 4 8 
"""
# n = int(input())
# result = 2
# while result < n:
#     print(result)
#     result *= 2
    
    
            

